app/controllers/stats_controller.rb

  def index
    @stats = Stat.all
---
SELECT * FROM `stats`

  def show
    @stat = Stat.find(params[:id])
---
SELECT * FROM `stats` WHERE (`stats`.`id` = 1)

  def new

@rand1=rand(33)+1
@rand2=rand(33)+1
while @rand1 == @rand2
   @rand2=rand(33)+1

end

@v1=Stat.find(@rand1)
---
SELECT * FROM `stats` WHERE (`stats`.`id` = 7)

def vote


@v=Stat.find(params[:id])
@v.update_attributes(:vote => @v.vote+1)
---
SELECT * FROM `stats` WHERE (`stats`.`id` = 11)
UPDATE `stats` SET `updated_at` = '2013-05-15 09:44:05', `display` = 1 WHERE `id` = 17